tap "asmvik/formulae"
tap "djetelina/tap"
tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae"
tap "jackielii/tap"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin", restart_service: :changed
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU binary tools for native development
brew "binutils"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Diff that understands syntax
brew "difftastic"
# File comparison utilities
brew "diffutils"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interactive git commands in the terminal
brew "forgit"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Command-line tool to delete merged Git branches
brew "git-delete-merged-branches"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# TUI Git client inspired by Magit
brew "gitu"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Simple terminal UI for git commands
brew "lazygit"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Microsoft SQL Server command-line interface
brew "sqlcmd"
# CLI utility for manipulating SQLite databases
brew "sqlite-utils"
# Cross-shell prompt for astronauts
brew "starship"
# Official tldr client written in Rust
brew "tlrc"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Simple hotkey daemon for macOS, written in Zig
brew "jackielii/tap/skhd-zig"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Virtual monitor for screen sharing
cask "deskpad"
# Utility to support moving and resizing using a modifier key and mouse drag
cask "easy-move+resize"
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-fantasque-sans-mono"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-serif"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Clipboard manager
cask "maccy"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# System monitor for the menu bar
cask "stats"
# Menu bar manager
cask "thaw"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
mas "1Password for Safari", id: 1569813296
mas "AudioWrangler", id: 1565701763
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "uBlock Origin Lite", id: 6745342698
vscode "alefragnani.bookmarks"
vscode "alexandernanberg.horizon-theme-vscode"
vscode "atlassian.atlascode"
vscode "aykutsarac.jsoncrack-vscode"
vscode "b5261b62-5943-495a-a2cd-2b281ddb7a76.vscode-nier-automata-theme"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bmalehorn.vscode-fish"
vscode "brunnerh.insert-unicode"
vscode "burkeholland.simple-react-snippets"
vscode "carrie999.cyberpunk-2020"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.path-intellisense"
vscode "circlecodesolution.ccs-flutter-color"
vscode "cometeer.spacemacs"
vscode "darkriszty.markdown-table-prettify"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-markdown-todo"
vscode "fabiospampinato.vscode-open-in-github"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "hirofumii.rubyblue-theme"
vscode "hverlin.mise-vscode"
vscode "jdinhlife.gruvbox"
vscode "johnpapa.vscode-peacock"
vscode "jwsandeman.cyberpunk2077-theme"
vscode "kuba-p.theme-pink-candy"
vscode "maher-cshub.orangy-one-light-theme"
vscode "max-ss.cyberpunk"
vscode "mechatroner.rainbow-csv"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.vscode-chat-customizations-evaluations"
vscode "mvllow.rose-pine"
vscode "nalt.rename-file"
vscode "nataliefruitema.modern-purple-theme"
vscode "nrwl.angular-console"
vscode "patcx.vscode-nuget-gallery"
vscode "redhat.vscode-yaml"
vscode "robbowen.synthwave-vscode"
vscode "romantomjak.go-template"
vscode "tamasfe.even-better-toml"
vscode "task.vscode-task"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "voidei.vscode-vimrc"
vscode "webfreak.cute-theme"
vscode "wenfangdu.jump"
vscode "wheredoesyourmindgo.gruvbox-concoctis"
vscode "yoshi389111.visible-whitespace"
npm "corepack"
