tap "cowsay-org/cowsay"
tap "danvergara/tools"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "lusingander/tap"
tap "martinfekete10/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "pls-rs/pls"
tap "qmk/qmk"
brew "atuin"
brew "awk"
brew "azure-cli"
brew "bash"
brew "bat"
brew "binutils"
brew "bitwarden-cli"
brew "python@3.12"
brew "chezmoi"
brew "coreutils"
brew "difftastic"
brew "diffutils"
brew "duckdb"
brew "ed"
brew "eza"
brew "fastfetch"
brew "fd"
brew "findutils"
brew "fish"
brew "fnm"
brew "fzf"
brew "forgit"
brew "gawk"
brew "gcc"
brew "gh"
brew "git"
brew "git-delete-merged-branches"
brew "git-delta"
brew "git-lfs"
brew "gitu"
brew "glow"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnutls"
brew "gnupg"
brew "go"
brew "gpatch"
brew "grep"
brew "gzip"
brew "hyperfine"
brew "m4"
brew "jq"
brew "lazygit"
brew "less"
brew "litecli"
brew "lsix"
brew "macos-trash"
brew "make"
brew "mas"
brew "mdcat"
brew "moreutils"
brew "nano"
brew "neovim"
brew "onefetch"
brew "pinentry-mac"
brew "pinfo"
brew "pipx"
brew "pnpm"
brew "poppler"
brew "ripgrep"
brew "rsync"
brew "screen"
brew "sqlite-utils"
brew "starship"
brew "tldr"
brew "tree"
brew "unzip"
brew "vim"
brew "watch"
brew "wdiff"
brew "wget"
brew "yazi"
brew "zig"
brew "zoxide"
brew "zsh"
brew "cowsay-org/cowsay/cowsay-org"
brew "koekeishiya/formulae/skhd"
brew "lusingander/tap/serie"
brew "oven-sh/bun/bun"
brew "qmk/qmk/qmk"
cask "1password-cli"
cask "browserosaurus"
cask "dbeaver-community"
cask "deskpad"
cask "dotnet-sdk"
cask "easy-move+resize"
cask "font-computer-modern"
cask "font-fantasque-sans-mono"
cask "font-ibm-plex"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "jordanbaird-ice"
cask "kitty"
cask "meld"
cask "middleclick"
cask "notunes"
cask "qmk-toolbox"
cask "rectangle"
cask "sqlitestudio"
cask "stats"
cask "trailer"
cask "tuneful"
cask "wezterm"
cask "zed"
mas "1Password for Safari", id: 1569813296
mas "Bitwarden", id: 1352778147
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keymapp", id: 6472865291
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Signal Shifter", id: 6446061552
mas "Xcode", id: 497799835
vscode "alefragnani.numbered-bookmarks"
vscode "ankitcode.firefly"
vscode "bceskavich.theme-dracula-at-night"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bmalehorn.vscode-fish"
vscode "bodil.file-browser"
vscode "brunnerh.insert-unicode"
vscode "canadaduane.vscode-kmonad"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "catppuccin.catppuccin-vsc-pack"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "connor4312.codesong"
vscode "daltonmenezes.aura-theme"
vscode "darkriszty.markdown-table-prettify"
vscode "davidanson.vscode-markdownlint"
vscode "daylerees.rainglow"
vscode "dbaeumer.vscode-eslint"
vscode "dberezin.lox-language"
vscode "dcasella.monokai-plusplus"
vscode "dennisvash.summer-time"
vscode "dimitarnonov.jellybeans-theme"
vscode "divyanshu013.back-to-the-code-vscode-theme"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "editorconfig.editorconfig"
vscode "eldritch.eldritch"
vscode "emilast.logfilehighlighter"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "ericsonwillians.oldschool-theme"
vscode "erik-rosengren.dark-candy"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "faceair.ayu-one-dark"
vscode "foxundermoon.shell-format"
vscode "gerane.theme-eggplantparm"
vscode "gerane.theme-gooeypastel"
vscode "gerane.theme-mcedit"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "huacat.pink-theme"
vscode "ibm.output-colorizer"
vscode "idleberg.applescript"
vscode "idleberg.hopscotch"
vscode "ionutvmi.reg"
vscode "irongeek.vscode-env"
vscode "iwyvi.chinolor"
vscode "jaredkent.laserwave"
vscode "jdinhlife.gruvbox"
vscode "jgrundback.vscode-mc-theme"
vscode "jinliming2.vscode-go-template"
vscode "joaomoreno.github-sharp-theme"
vscode "jordaneldredge.implicit-parentheses"
vscode "jprestidge.theme-material-theme"
vscode "kacperbiedka.one-candy-dark"
vscode "kalk.borland"
vscode "krueger71.crt-themes"
vscode "kuscamara.electron"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "louisyoung.pastel-pro"
vscode "mattn.lisp"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "millsp.material-candy"
vscode "minamarkham.yonce-theme"
vscode "mindaro-dev.file-downloader"
vscode "mishkinf.goto-next-previous-member"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.theme-1337"
vscode "ms-vscode.theme-tomorrowkit"
vscode "ms-vsliveshare.vsliveshare"
vscode "mvllow.rose-pine"
vscode "pawelgrzybek.gatito-theme"
vscode "pkief.material-icon-theme"
vscode "prateekmahendrakar.prettyxml"
vscode "qezhu.gitlink"
vscode "redhat.vscode-yaml"
vscode "renesaarsoo.sql-formatter-vsc"
vscode "robbowen.synthwave-vscode"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "s3gf4ult.monokai-vibrant"
vscode "sainnhe.gruvbox-material"
vscode "sdras.fortnite-vscode-theme"
vscode "selbh.keyboard-scroll"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sidneys1.gitconfig"
vscode "sswg.swift-lang"
vscode "stkb.rewrap"
vscode "sumitnalavade.tinkswave-22"
vscode "sumitsaha.learn-with-sumit-theme"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "timonwong.shellcheck"
vscode "tinaciousdesign.theme-tinaciousdesign"
vscode "tinkertrain.theme-panda"
vscode "tomphilbin.gruvbox-themes"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "voldemortensen.rainbow-tags"
vscode "waderyan.gitblame"
vscode "wenfangdu.faster-new"
vscode "wenfangdu.jump"
vscode "wesbos.theme-cobalt2"
vscode "willasm.comment-highlighter"
vscode "xadillax.viml"
vscode "yoshi389111.visible-whitespace"
vscode "yzhang.markdown-all-in-one"
vscode "zadvorny.theme-happy-hipster"
vscode "zhuangtongfa.material-theme"
