tap "asmvik/formulae"
tap "felixkratz/formulae"
tap "jackielii/tap"
brew "atuin"
brew "azure-cli"
brew "bash"
brew "bat"
brew "binutils"
brew "chezmoi"
brew "coreutils"
brew "difftastic"
brew "diffutils"
brew "eza"
brew "fd"
brew "findutils"
brew "fish"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-delete-merged-branches"
brew "git-delta"
brew "git-lfs"
brew "gitu"
brew "go"
brew "go-task"
brew "lazygit"
brew "less"
brew "mas"
brew "moreutils"
brew "nano"
brew "neovim"
brew "ripgrep"
brew "rsync"
brew "shellcheck"
brew "sqlite-utils"
brew "starship"
brew "tlrc"
brew "tree"
brew "vim"
brew "zoxide"
brew "zsh"
brew "felixkratz/formulae/borders"
brew "jackielii/tap/skhd-zig"
cask "deskpad"
cask "easy-move+resize"
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-serif"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "maccy"
cask "rectangle"
cask "stats"
cask "thaw"
cask "wezterm"
mas "1Password for Safari", id: 1569813296
mas "AudioWrangler", id: 1565701763
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bmalehorn.vscode-fish"
vscode "brunnerh.insert-unicode"
vscode "burkeholland.simple-react-snippets"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "jdinhlife.gruvbox"
vscode "johnpapa.vscode-peacock"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "nrwl.angular-console"
vscode "redhat.vscode-yaml"
vscode "romantomjak.go-template"
vscode "task.vscode-task"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "voidei.vscode-vimrc"
vscode "wenfangdu.jump"
vscode "yoshi389111.visible-whitespace"
